cf_billing/Catalogs/энргАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргАбоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агентский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домовладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальноеОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМуниципальноеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнутрРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГород</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПрописки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыАбонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНасПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРайонАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУлица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPабонент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЕИРЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргГруппыПотребителейАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргГруппыПотребителейАбонентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРЭК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргАбоненты/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргАбоненты(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

#КонецОбласти

#Область СобытияСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;

	Если ТекСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
			
	Если ТекСтрока.Свойство("Ссылка") Тогда 		
		ТекЭлемент = ТекСтрока.ссылка;
		
		УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЛС(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран абонент");
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ЭтоГруппа тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закрытие лицевого для группы не доступно");
		Возврат;
	КонецЕсли; 	
	
	ДанныеЗаполнения  = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидОперации",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС"));
	ДанныеЗаполнения.Вставить("Абонент",ТекСтрока.ссылка);
	ДанныеЗаполнения.Вставить("Район",ТекСтрока.Район);
	ДанныеЗаполнения.Вставить("Организация",ТекСтрока.Организация);
	ДанныеЗаполнения.Вставить("КлючПомещения",ТекСтрока.КлючПомещения);
	
	ПараметрыОткрытия  =Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",ДанныеЗаполнения);
	ПараметрыОткрытия.Вставить("ЗаполнитьДокумент",Истина);	
	ОткрытьФорму("Документ.энргОперацияСЛицевымСчетом.Форма.ФормаДокументаЗакрытиеЛС",ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПлощади(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргУстановитьЗначениеПлощади.ФормаОбъекта");	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолвоПрописанных(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргУстановитьКоличествоПрописанных.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУслугу(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСУслугами.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги"));
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУслугу(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСУслугами.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги"));
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриборУчета(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСПриборомУчета.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ"));
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПриборУчета(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСПриборомУчета.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьПриборУчета(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргОперацияСПриборомУчета.ФормаОбъекта",ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидБлагоустройства(Команда)
	ОткрытьФормуНовогоДокумента("Документ.энргУстановитьВидБлагоустройстваАбонента.ФормаОбъекта");	
КонецПроцедуры

#КонецОбласти

#Область СобытияКонтролерыМаршруты

&НаКлиенте
Процедура КонтролерыМаршрутыПередНачаломИзменения(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтролерыМаршрутыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоДокумента(ИмяОткрываемойФормы,ВидОперации = Неопределено)
	ТекСтрока 					= Элементы.Список.ТекущиеДанные;
	
	ЗаполнитьДокумент 			= Истина;
	ПараметрыФормы 				= Новый Структура;
	ПараметрыФормы.Вставить("ЗаполнитьДокумент",ЗаполнитьДокумент);
	
	Если ЗаполнитьДокумент тогда
		ЗначенияЗаполнения  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
		ЗначенияЗаполнения.Абонент  = ТекСтрока.ссылка;
		ЗначенияЗаполнения.Организация  	= ТекСтрока.Организация;
		ЗначенияЗаполнения.Район		  	=  ТекСтрока.Район;
		ЗначенияЗаполнения.КлючПомещения	=ТекСтрока.КлючПомещения;
		//энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЗначенияЗаполнения); 
	иначе
		ЗначенияЗаполнения = Новый Структура;
	КонецЕсли;
	ЕСли ВидОперации <>Неопределено тогда
		ЗначенияЗаполнения.Вставить("ВидОперации",ВидОперации);
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	ОткрытьФорму(ИмяОткрываемойФормы,ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока)
	
	Абонент 	= ТекСтрока.ссылка;		
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Район", ТекСтрока.Район);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	энргАбоненты.КлючПомещения.Строение КАК Строение
	               |ПОМЕСТИТЬ ВТ_СтрАб
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |ГДЕ
	               |	энргАбоненты.Ссылка = &Абонент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	энргСтроенияКонтактнаяИнформация.Представление КАК Представление,
	               |	энргСтроенияКонтактнаяИнформация.Ссылка КАК Строение
	               |ПОМЕСТИТЬ ВТ_Строение
	               |ИЗ
	               |	ВТ_СтрАб КАК ВТ_СтрАб
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	               |		ПО ВТ_СтрАб.Строение = энргСтроенияКонтактнаяИнформация.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргСтроенияКонтактнаяИнформация.Ссылка,
	               |	энргСтроенияКонтактнаяИнформация.Представление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК АдресМаршрута,
	               |	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка.Владелец КАК Контролер,
	               |	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка КАК Маршрут
	               |ИЗ
	               |	ВТ_Строение КАК ВТ_Строение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	               |		ПО (ВТ_Строение.Представление ПОДОБНО энргМаршрутыКонтроллеровАдресаМаршрута.Представление)";
	
	
	
	Результат 							= Запрос.Выполнить();
	ВыгрузкаМаршруты 					= Результат.Выгрузить();
	КонтролерыМаршруты.Загрузить(ВыгрузкаМаршруты);
	
	запрос = новый запрос;
	запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", ТекСтрока.Организация);
	Запрос.УстановитьПараметр("Район", ТекСтрока.Район);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	Запрос.Текст=  "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Ссылка,
	               |	энргАбоненты.КлючПомещения КАК КлючПомещения
	               |ПОМЕСТИТЬ СпрАбонент
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |ГДЕ
	               |	энргАбоненты.Ссылка = &Абонент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ГруппаПотребителей,
	               |	СпрАбонент.КлючПомещения КАК КлючПомещения,
	               |	энргГруппыПотребителейАбонентовСрезПоследних.Период КАК Период,
	               |	энргГруппыПотребителейАбонентовСрезПоследних.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РегистрГруппы
	               |ИЗ
	               |	СпрАбонент КАК СпрАбонент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И КлючПомещения В
	               |						(ВЫБРАТЬ
	               |							СпрАбонент.КлючПомещения КАК КлючПомещения
	               |						ИЗ
	               |							СпрАбонент КАК СпрАбонент)) КАК энргГруппыПотребителейАбонентовСрезПоследних
	               |		ПО СпрАбонент.КлючПомещения = энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегистрГруппы.ГруппаПотребителей КАК ГруппаПотребителей,
	               |	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	               |	энргЗначенияТарифовСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрГруппы КАК РегистрГруппы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	               |				&Период,
				   |				Организация = &Организация
				   |					И Район = &Район
				   |	) КАК энргЗначенияТарифовСрезПоследних
	               |		ПО РегистрГруппы.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегистрГруппы.ГруппаПотребителей,
	               |	энргЗначенияТарифовСрезПоследних.Услуга,
	               |	энргЗначенияТарифовСрезПоследних.Значение";
	Результат = Запрос.Выполнить();
	ВыгрузкаТарифы = Результат.Выгрузить();
	Тарифы.Загрузить(ВыгрузкаТарифы);
	

	КлючПомещения = ТекСтрока.КлючПомещения;//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Абонент, "КлючПомещения");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Услуги,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПриборыУчетаАбонента,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлощадиАбонента,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КоличествоПрописанных,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТочкиУчета,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВидБлагоустройства,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтключаемыеВНеполивнойСезон,"Абонент",Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостояниеЛС,"Абонент",Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КоличествоПроживающих,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Начисления,"Абонент",Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(энргИсторияДоговоровАбонента,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Оплата,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Авансы,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РаспределениеПлатежей,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПоказанияПрибораУчетаИстория,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормулаРасчетаТУ,"Абонент", Абонент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
